package Exec.Root.Modules;

import java.util.HashMap;

public interface RootCode_Date {
	/*
	 * Get method's name by its alias
	 * Returns null if method doesn't exists or access denied
	 */
	public default void Init_Date(HashMap<String,String> map) {
/*
// Дата
РабочаяДата		(дата, режим авто смены (0-не менять, 1-спрашивать, 2-без вопросов))
ТекущаяДата
ДобавитьМесяц	(дата, число месяцев)
НачМесяца
КонМесяца
НачКвартала
КонКвартала
НачГода
КонГода
НачНедели
КонНедели
ДатаГод
ДатаМесяц
ДатаЧисло
НомерНеделиГода
НомерДляГода
НомерДняНедели
ПериодСтр	(дата1, дата2)
НачалоСтандартногоИнтервала	(дата или вариант)
КонецСтандартногоИнтервала	(дата или вариант)

// Время
ТекущееВремя	(Часы, Минуты, Секунды) 
*/
	}
}
